/*

  - Имплементируйте logStep декоратор как в лекции
  - Используйте его на все методы сервисов/пейджей/api, используя кастомные названия шагов
  - Создайте enum TAGS, со значениями SMOKE, REGRESSION, UI, API, VISUAL_REGRESSION
  - Используйте теги из енама в КАЖДОМ уже реализованном у вас тесте
  - Реализуйте переиспользование логина для всех UI тестов (кроме тестов проверяющих логин)
  - Тесты НЕ должны падать ;)
  - Приложите скриншот отчета с проходящими тестами и реализованным всем из задания ;)

*/